In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))

In [17]:
df.iloc[:4,1]=NA

In [18]:
df.iloc[:2,2]=NA

In [19]:
df

          0         1         2
0 -0.288277       NaN       NaN
1  1.133971       NaN       NaN
2 -0.505047       NaN -0.750688
3 -0.717560       NaN -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [20]:
df.dropna(thresh = 2)#一行必须有2个以上的观测数据才会留下

          0         1         2
2 -0.505047       NaN -0.750688
3 -0.717560       NaN -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [21]:
df.dropna(thresh = 1)

          0         1         2
0 -0.288277       NaN       NaN
1  1.133971       NaN       NaN
2 -0.505047       NaN -0.750688
3 -0.717560       NaN -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [22]:
df.dropna(thresh = 3)

          0         1         2
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [23]:
df.fillna(0)

          0         1         2
0 -0.288277  0.000000  0.000000
1  1.133971  0.000000  0.000000
2 -0.505047  0.000000 -0.750688
3 -0.717560  0.000000 -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.288277  0.500000  0.000000
1  1.133971  0.500000  0.000000
2 -0.505047  0.500000 -0.750688
3 -0.717560  0.500000 -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [25]:
df

          0         1         2
0 -0.288277       NaN       NaN
1  1.133971       NaN       NaN
2 -0.505047       NaN -0.750688
3 -0.717560       NaN -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [26]:
df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -0.288277  0.000000  0.000000
1  1.133971  0.000000  0.000000
2 -0.505047  0.000000 -0.750688
3 -0.717560  0.000000 -2.400126
4  0.997064 -0.575261  0.554309
5 -0.408795 -1.170985  1.491976
6 -0.416406 -0.029137 -0.913202

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
df

          0         1         2
0 -0.393057 -0.386275  0.511965
1 -0.802569 -0.955958  0.577701
2 -0.812699 -1.159119 -1.027593
3 -1.443769 -0.262095 -0.732225
4  0.782151  1.314152  1.886430
5 -0.127356 -0.081618 -0.878989

In [31]:
df.iloc[2:,1]=NA

In [32]:
df.iloc[4:,2]=NA

In [33]:
df

          0         1         2
0 -0.393057 -0.386275  0.511965
1 -0.802569 -0.955958  0.577701
2 -0.812699       NaN -1.027593
3 -1.443769       NaN -0.732225
4  0.782151       NaN       NaN
5 -0.127356       NaN       NaN

In [34]:
df.fillna(method='ffill')

          0         1         2
0 -0.393057 -0.386275  0.511965
1 -0.802569 -0.955958  0.577701
2 -0.812699 -0.955958 -1.027593
3 -1.443769 -0.955958 -0.732225
4  0.782151 -0.955958 -0.732225
5 -0.127356 -0.955958 -0.732225

In [35]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.393057 -0.386275  0.511965
1 -0.802569 -0.955958  0.577701
2 -0.812699 -0.955958 -1.027593
3 -1.443769 -0.955958 -0.732225
4  0.782151       NaN -0.732225
5 -0.127356       NaN -0.732225

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['vi']=range(7)

In [41]:
data

    k1  k2  vi
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  vi
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  vi
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [48]:
lowercased = data['food'].str.lower() #所有字母都转换成小写

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal']=lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x :meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [56]:
meat_to_animal['bacon']

'pig'

In [57]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [63]:
transform = lambda x: x[:4].upper()

In [64]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [65]:
data.index = data.index.map(transform)

In [66]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [68]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [69]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [70]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [71]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [72]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [73]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages,bins)

In [74]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [75]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [76]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [77]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [78]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']

In [79]:
group_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [80]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [81]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [82]:
cats=pd.cut(ages, bins, labels=group_names)

In [83]:
cats.categories

Index(['Youth', 'YoungAdult', 'MiddleAged', 'Senior'], dtype='object')

In [84]:
pd.value_counts(cats)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

In [85]:
data = np.random.rand(20)

In [86]:
data

array([0.82044691, 0.96513304, 0.7912871 , 0.98260242, 0.91317452,
       0.12891512, 0.25082312, 0.8785015 , 0.62350405, 0.6590325 ,
       0.224638  , 0.78605601, 0.39685886, 0.03289077, 0.43328607,
       0.50358923, 0.87489885, 0.29182321, 0.99177048, 0.58945621])

In [87]:
pd.cut(data,4,precision = 2)

[(0.75, 0.99], (0.75, 0.99], (0.75, 0.99], (0.75, 0.99], (0.75, 0.99], ..., (0.27, 0.51], (0.75, 0.99], (0.27, 0.51], (0.75, 0.99], (0.51, 0.75]]
Length: 20
Categories (4, interval[float64]): [(0.032, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [88]:
data = np.random.randn(1000)

In [91]:
cats = pd.qcut(data,4)

In [92]:
cats

[(0.674, 3.107], (-0.682, 0.0126], (-0.682, 0.0126], (-0.682, 0.0126], (0.674, 3.107], ..., (-0.682, 0.0126], (0.0126, 0.674], (0.0126, 0.674], (-0.682, 0.0126], (0.0126, 0.674]]
Length: 1000
Categories (4, interval[float64]): [(-3.483, -0.682] < (-0.682, 0.0126] < (0.0126, 0.674] < (0.674, 3.107]]

In [93]:
pd.value_counts(cats)

(0.674, 3.107]      250
(0.0126, 0.674]     250
(-0.682, 0.0126]    250
(-3.483, -0.682]    250
dtype: int64

In [96]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [97]:
pd.value_counts(cats)

(0.0126, 1.343]     400
(-1.388, 0.0126]    400
(1.343, 3.107]      100
(-3.483, -1.388]    100
dtype: int64

In [98]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [99]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028420    -0.013956     0.018109    -0.029339
std       0.982264     1.008680     1.026658     1.001787
min      -2.562854    -3.520554    -3.342572    -3.079732
25%      -0.725500    -0.687158    -0.663122    -0.668978
50%      -0.044333    -0.026534     0.027668    -0.009998
75%       0.687120     0.643049     0.744657     0.655349
max       2.769391     3.066564     2.711371     3.140367

In [100]:
col = data[2]

In [101]:
col[np.abs(col)>3]

26    -3.300096
191   -3.143506
917   -3.263650
937   -3.199875
956   -3.342572
Name: 2, dtype: float64

In [102]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
26   0.143822  1.816736 -3.300096  1.538838
121 -0.655080 -3.520554 -1.052755 -0.198920
191 -1.287146  1.893780 -3.143506  0.722072
301 -0.726713 -3.086804  0.716849  0.796902
447 -0.284202  3.066564  1.690495  0.829912
475  0.429065 -0.084127 -0.514606  3.140367
857 -0.402947 -0.550877 -0.198612 -3.061344
917  0.867986  1.592146 -3.263650  0.006584
937 -0.501832  1.758734 -3.199875  0.244949
956  0.207873 -0.275002 -3.342572  1.204247
978 -0.268717 -2.299423 -1.029248 -3.079732

In [114]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
26   0.143822  1.816736 -3.300096  1.538838
121 -0.655080 -3.520554 -1.052755 -0.198920
191 -1.287146  1.893780 -3.143506  0.722072
301 -0.726713 -3.086804  0.716849  0.796902
447 -0.284202  3.066564  1.690495  0.829912
475  0.429065 -0.084127 -0.514606  3.140367
857 -0.402947 -0.550877 -0.198612 -3.061344
917  0.867986  1.592146 -3.263650  0.006584
937 -0.501832  1.758734 -3.199875  0.244949
956  0.207873 -0.275002 -3.342572  1.204247
978 -0.268717 -2.299423 -1.029248 -3.079732

In [115]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [116]:
data

            0         1         2         3
0    0.052852  1.046891 -0.249099  0.378073
1    2.769391  0.584141  1.144674 -1.067206
2   -2.331152 -1.357674  0.630454 -0.005036
3   -1.142765 -2.272677 -0.615896 -1.593921
4    1.087142  1.958924 -0.691813  0.845292
5    0.722725 -0.920792 -0.635789  0.322380
6    0.238988 -0.478984 -0.616446  0.252922
7   -0.399081  0.809513 -0.786086 -2.068161
8   -0.845865  0.036698  1.384521 -0.507828
9   -1.121317 -0.577394  0.171085  1.272949
10  -0.439039  0.624779 -0.674164  0.052261
11   0.946191 -0.037429  1.038949  0.157007
12  -1.276293 -1.328754 -1.129750  0.564188
13  -0.138461  0.187436  0.703429  0.244150
14  -0.967257 -0.046592  0.593461 -0.478884
15   0.739567 -1.529846 -1.205196  0.061823
16  -2.306141  1.478331  1.219216 -1.920082
17   0.516051 -0.309026 -1.296814  1.331638
18  -0.047337 -1.511898  0.360203 -0.778710
19  -2.007683 -0.459086 -0.878977  0.246348
20   0.314885 -0.786899 -1.226110 -1.228987
21  -1.291644  1.120483 -0.092049 -0.342330
22  -0.122519  0.987300  0.013363  0.930765
23  -1.661875 -0.515376  1.951444 -0.202700
24  -1.270494 -0.329472  0.009040  0.103725
25  -0.983828 -0.564235 -1.016838  0.034840
26   0.143822  1.816736 -3.000000  1.538838
27   1.032570  2.527211 -0.250646 -1.823435
28  -1.726180  1.046622  0.658087  0.208624
29   1.266470  0.172679 -0.669668 -1.250140
..        ...       ...       ...       ...
970  0.975709 -0.971834 -0.403913  0.592305
971  0.945348  0.000023  0.387668  2.503178
972 -0.538426  0.950683  0.874760 -0.148765
973  2.469525  0.526683 -1.364055 -1.640608
974 -0.638137 -0.556300  0.848744  0.666672
975  1.698651 -1.908653  0.655142  0.784154
976 -1.658153  0.498903  1.411237  0.891451
977  0.821499 -1.041167  0.652947 -1.552613
978 -0.268717 -2.299423 -1.029248 -3.000000
979 -0.599510  1.539485 -0.517480 -1.176602
980  1.355119 -0.571713  0.931442  0.948575
981  0.225512 -0.790463 -0.977972  1.231834
982 -0.121148  1.022847  0.214174  0.069946
983  0.828766 -0.188871 -0.775426 -1.800930
984  0.896196  0.342729 -0.110698 -0.401542
985  0.023047 -0.593382  0.819474  1.359557
986  0.309540 -0.390680  0.215675 -1.716356
987 -0.197259  0.906310 -1.152213  0.037992
988 -0.621279  1.687011 -1.838446  0.712300
989  0.322151  0.247991 -0.503920 -0.917901
990 -0.475366 -1.520057 -1.177636  0.055903
991  0.890151 -0.139330 -0.048276 -0.878083
992 -0.273774  0.735095  0.262655 -0.485304
993  0.191931  1.433491  0.389868 -0.786942
994 -0.942772 -0.747411  0.015019  0.808317
995  0.820637  1.551648 -1.060812 -1.310488
996  0.457829  0.891686  0.363160 -0.035453
997 -1.745684  0.515578  2.452394 -0.751226
998 -0.742920  1.937163 -0.106345 -1.046216
999 -0.419735 -1.635920  0.116718  0.521789

[1000 rows x 4 columns]

In [117]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028420    -0.013415     0.019358    -0.029338
std       0.982264     1.006538     1.022808     1.000928
min      -2.562854    -3.000000    -3.000000    -3.000000
25%      -0.725500    -0.687158    -0.663122    -0.668978
50%      -0.044333    -0.026534     0.027668    -0.009998
75%       0.687120     0.643049     0.744657     0.655349
max       2.769391     3.000000     2.711371     3.000000

In [118]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0  1.0 -1.0  1.0

In [120]:
data[np.abs(data)>3].dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [121]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028420    -0.013415     0.019358    -0.029338
std       0.982264     1.006538     1.022808     1.000928
min      -2.562854    -3.000000    -3.000000    -3.000000
25%      -0.725500    -0.687158    -0.663122    -0.668978
50%      -0.044333    -0.026534     0.027668    -0.009998
75%       0.687120     0.643049     0.744657     0.655349
max       2.769391     3.000000     2.711371     3.000000

In [122]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [124]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005461     0.001456     0.010735    -0.053211
std       1.028685     0.993565     1.008970     1.027701
min      -2.939300    -3.597552    -3.246037    -3.595798
25%      -0.682262    -0.647861    -0.721675    -0.761568
50%       0.007988     0.001617     0.025144    -0.009685
75%       0.695345     0.646046     0.697664     0.660539
max       3.494323     3.370885     3.182927     3.439353

In [127]:
data[np.abs(data)>3].dropna(thresh=1)

            0         1         2         3
10        NaN       NaN       NaN  3.136645
98        NaN -3.597552       NaN       NaN
170       NaN       NaN       NaN -3.595798
216       NaN  3.370885       NaN       NaN
220       NaN  3.149886       NaN       NaN
236       NaN  3.202975       NaN       NaN
239       NaN       NaN       NaN  3.439353
359       NaN       NaN -3.246037       NaN
510       NaN       NaN  3.182927       NaN
582  3.494323       NaN       NaN       NaN
847       NaN       NaN       NaN  3.393404

In [130]:
df = pd.DataFrame(np.arange(20).reshape((5, 4)))

In [131]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [132]:
sampler = np.random.permutation(5)

In [134]:
sampler

array([3, 1, 0, 4, 2])

In [135]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [136]:
df.sample(n =3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [137]:
df.sample(n =5)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [138]:
choices = pd.Series([5,7,-1,6,4])

In [139]:
draws = choices.sample(n = 10,replace=True)

In [140]:
draws

1    7
4    4
4    4
1    7
2   -1
1    7
0    5
1    7
4    4
0    5
dtype: int64

In [141]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [142]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [143]:
pd.get_dummies(df['key']) #dummy 意为傀儡

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [144]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [150]:
df_with_dummy = df[['data1']].join(dummies)

In [151]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [152]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [153]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [154]:
mnames = ['movie_id', 'title', 'genres']

In [157]:
movies = pd.read_table('pydata-book-2nd-edition/datasets/movielens/movies.dat',sep='::',header=None, names=mnames)

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [159]:
movies = pd.read_table('movies.dat', sep='::',
                       header=None, names=mnames)#后面的警告可以不管

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [160]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [161]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [162]:
genres = pd.unique(all_genres)

In [163]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [175]:
all_genres.append('abc')

In [176]:
genres = pd.unique(all_genres)

In [178]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western', 'a', 'b', 'c', 'abc'], dtype=object)

In [179]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [180]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [181]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,...,Documentary,War,Musical,Mystery,Film-Noir,Western,a,b,c,abc
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
11,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
12,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
13,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
14,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
15,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
17,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
19,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
20,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
21,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
22,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
23,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
24,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
25,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
26,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
27,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
28,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
29,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3853,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3854,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3855,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3856,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3857,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3858,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3859,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3860,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3861,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3862,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3863,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3864,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3865,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3866,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3867,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3868,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3869,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3870,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3871,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3872,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3873,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3874,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3875,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3876,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [182]:
gen = movies.genres[0]

In [183]:
gen

"Animation|Children's|Comedy"

In [184]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [185]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [186]:
dummies.columns

Index(['Animation', 'Children's', 'Comedy', 'Adventure', 'Fantasy', 'Romance',
       'Drama', 'Action', 'Crime', 'Thriller', 'Horror', 'Sci-Fi',
       'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir', 'Western', 'a',
       'b', 'c', 'abc'],
      dtype='object')

In [187]:
for i ,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

In [188]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [189]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Genre_a                                        0
Genre_b                                        0
Genre_c                                        0
Genre_abc                                      0
Name: 0, dtype: object

In [190]:
np.random.seed(12345)

In [191]:
values = np.random.rand(10)

In [192]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [193]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [195]:
df = pd.Series(pd.cut(values,bins))

In [196]:
df

0    (0.8, 1.0]
1    (0.2, 0.4]
2    (0.0, 0.2]
3    (0.2, 0.4]
4    (0.4, 0.6]
5    (0.4, 0.6]
6    (0.8, 1.0]
7    (0.6, 0.8]
8    (0.6, 0.8]
9    (0.6, 0.8]
dtype: category
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [197]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [198]:
val = 'a,b, guido'

In [199]:
val.split(',')

['a', 'b', ' guido']

In [200]:
pieces = [x.strip() for x in val.split(',')]

In [201]:
pieces

['a', 'b', 'guido']

In [202]:
a,b,c = pieces

In [203]:
a

'a'

In [204]:
a+'::'+b+'::'+c

'a::b::guido'

In [205]:
'::'.join(pieces)

'a::b::guido'

In [206]:
'guido' in val

True

In [207]:
val.index(',')

1

In [208]:
val

'a,b, guido'

In [211]:
val.find(':')

-1

In [212]:
import re

In [213]:
text = "foo bar\t baz \tqux"

In [215]:
re.split('s+',text)

['foo', 'bar', 'baz', 'qux']

In [216]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [217]:
regex = re.compile('\s+')

In [218]:
regex

re.compile(r'\s+', re.UNICODE)

In [219]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [220]:
regex.findall(text)

[' ', '\t ', ' \t']

In [221]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [222]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [223]:
regex = re.compile(pattern,flags = re.IGNORECASE)

In [224]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [225]:
m = regex.search(text)

In [226]:
m

In [227]:
text[m.start():m.end()]

'dave@google.com'

In [228]:
print(regex.match(text))

None

In [229]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [230]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [231]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [232]:
m = regex.match('wesm@bright.net')

In [233]:
m.groups()

('wesm', 'bright', 'net')

In [234]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [235]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [236]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [237]:
data

{'Dave': 'dave@google.com',
 'Rob': 'rob@gmail.com',
 'Steve': 'steve@gmail.com',
 'Wes': nan}

In [238]:
data = pd.Series(data)

In [239]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [240]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [241]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [242]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [243]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [244]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [245]:
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [246]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [247]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object